# Γράψτε ένα πρόγραμμα σε Python το οποίο προσομοιώνει 3 έξυπνα φανάρια
# στα οποία υπάρχει τυχαία ροή αυτοκινήτων. Τα τρία φανάρια ξεκινάνε με 
# ένα τυχαίο πλήθος αυτοκινήτων. Πράσινο έχει πάντα το φανάρι με τα 
# περισσότερα αυτοκίνητα, αν είναι παραπάνω διαλέγουμε ένα στην τύχη. 
# Σε κάθε άναμα του φαναριού μπορούν να φύγουν αυτοκίνητα (τυχαία από 5-10)
# από αυτό που είναι κόκκινο, ενώ παράλληλα έρχονται και στα άλλα δύο αυτοκίνητα (0-5). 
# Το πρόγραμμά σας εμφανίζει σε κάθε άναμα πράσινου τα αυτοκίνητα που έχει το κάθε φανάρι και πόσα έρχονται/φεύγουν.



import random
#random.random()
# Αν θέλεις να κάνεις έλεγχο των αποτελεσμάτων και θέλεις να σου εμφανίζει τους 
# ίδιους τυχαίους αριθμούς κάθε φορά κάνε uncomment την ακόλουθη εντολή
#random.seed(667)

def maximum(a, b, c): 
    list = [a, b, c] 
    return max(list) 


fana = random.randint(0, 100)
fanb = random.randint(0, 100)
fanc = random.randint(0, 100)
print("Το φανάρι Α έχει :", fana) 
print("Το φανάρι B έχει :", fanb) 
print("Το φανάρι Γ έχει :", fanc) 

ap = input("Όταν βαρεθείς να παίζεις με τα φανάρια πάτα Ο για Όχι (Ξέρεις εσύ) : ") 

# Προσοχή η random.randint(x,y) δίνει τυχαίους αριθμούς στο διάστημα [x,y] γιατί απλά μπορεί
# οπότε 
newcars = random.randint(5, 10)
