# Γράψτε μια συνάρτηση σε Python η οποία υπολογίζει το ποσό πληρωμής
# όταν της περνάει ο χρήστης τις εγγραφές ενός λεξικού σε λίστα
# για το τι αγόρασε και το ποσοστό φόρου.
# Άσκηση 3

# Έχουμε δημιουργήσει ένα λεξικό με εικονικά προϊόντα και τιμές για να δοκιμάσουμε την 
# συνάρτηση
import csv

# Συνάρτηση για τον υπολογσιμό του συνολικού φόρου.
# Δέχεται σαν παραμέτρους ένα λεξικό και το ποσοστό του φόρου
def returnSum(myDict, foros): 
    sum = 0
    for i in myDict: 
        #Χρησιμοποιούμε τη μέθοδο float για ομογενοποίηση των τιμών
        sum = sum + float(myDict[i])
    return sum *((100+foros)/100)


sample_dict = {'a': 100, 'b':200, 'c':300, 'd':100 } 

#εισαγωγή στοιχείων απο το συνοδευτικό csv αρχείο και πέρασμα σε λεξικό 
reader = csv.reader(open('mock_data_dict.csv', 'r'))
mydict = {}
for row in reader:
   k, v = row
   mydict[k] = v

#Δοκιμή της συνάρτησης με τα 2 σετ δεδομένων
print("To συνολικό ποσό που πρέπει να πληρωθεί είναι :", returnSum(mydict,24)) 
print("To συνολικό ποσό που πρέπει να πληρωθεί είναι :", returnSum(sample_dict,19)) 

