# Γράψτε ένα πρόγραμμα σε Python το οποίο προσομοιώνει 3 έξυπνα φανάρια
# στα οποία υπάρχει τυχαία ροή αυτοκινήτων. Τα τρία φανάρια ξεκινάνε με 
# ένα τυχαίο πλήθος αυτοκινήτων. Πράσινο έχει πάντα το φανάρι με τα 
# περισσότερα αυτοκίνητα, αν είναι παραπάνω διαλέγουμε ένα στην τύχη. 
# Σε κάθε άναμα του φαναριού μπορούν να φύγουν αυτοκίνητα (τυχαία από 5-10)
# από αυτό που είναι κόκκινο, ενώ παράλληλα έρχονται και στα άλλα δύο αυτοκίνητα (0-5). 
# Το πρόγραμμά σας εμφανίζει σε κάθε άναμα πράσινου τα αυτοκίνητα που έχει το κάθε φανάρι και πόσα έρχονται/φεύγουν.



import random
#random.random()

#random.seed(667)

#Αρχικοποίηση των φαναριών με τυχαίες τιμές αυτοκινήτων
fana = random.randint(0, 100)
fanb = random.randint(0, 100)
fanc = random.randint(0, 100)
print("Το φανάρι Α έχει :", fana) 
print("Το φανάρι B έχει :", fanb) 
print("Το φανάρι Γ έχει :", fanc) 
#καταχώρηση τους σε ένα dictionary με κλειδί το όνομα του φαναριού
fanaria= {'φανάρι Α':fana, 'φανάρι Β':fanb, 'φανάρι Γ': fanc}

ap = 'Y'

#επανάληψη που προσομοιώνει το άναμα των φαναριών και τη ροή των αυτοκινήτων
while ap!='O':
 
  #Το prasino φιλοξενεί την ονομασία του φαναριού - δείκτης στο λεξικο ενώ το maxfan την τιμή
  prasino=max(fanaria, key=fanaria.get)
  maxfan=(max(fanaria.values()))
  #για κάθε ένα από τα τρία φανάρια - διάσχιση του λεξικού βρίσκουμε 
  #αν είναι το μεγαλύτερο και αντίστοιχα προσθέτουμε ή διώχνουμε αυτοκίνητα
  #η παράμετρος key στο max του λεξικού που φωνάζουμε επιστρέφει μόνο μια τιμή οπότε 
  #επιλέγεται τυχαία το φανάρι σε περίπτωση που έχουν την ίδια ουρά 
  for fanari in fanaria:
    newcars=random.randint(5, 10)
    if fanari == prasino:
      print('Από το',prasino, 'έφυγαν',newcars, ' αυτοκίνητα')
      fanaria[prasino]-=newcars
    else:
      print('Στο',fanari , 'ήρθαν ',newcars, 'ακόμα αυτοκίνητα')
      fanaria[fanari]+=newcars
  print("Το φανάρι Α έχει :", fanaria['φανάρι Α']) 
  print("Το φανάρι B έχει :", fanaria['φανάρι Β']) 
  print("Το φανάρι Γ έχει :", fanaria['φανάρι Γ']) 
  print("Κορναρίσματα")
  ap =input('Όταν βαρεθείς να παίζεις με τα φανάρια πάτα Ο για Όχι:')